Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_SRC_GENERAL.h
#define SRC_GENERAL_SRMASK_CM7_RESET_MASK_LOCKED_MASK (0x4000000U)
#define SRC_GENERAL_SRMASK_CM7_RESET_MASK_LOCKED_SHIFT (26U)
/*! CM7_RESET_MASK_LOCKED - Lock CM7 reset mask bit
 *  0b0..CM7_RESET_MASK's value can be changed.
 *  0b1..This bit and CM7_RESET_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_CM7_RESET_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM7_RESET_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_CM7_RESET_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_LOCKED_MASK (0x8000000U)
#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_LOCKED_SHIFT (27U)
/*! CM7_LOCKUP_MASK_LOCKED - Lock CM7_LOCKUP_MASK
 *  0b0..CM7_LOCKUP_MASK's value can be changed.
 *  0b1..This bit and CM7_LOCKUP_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_LOCKED_MASK (0x10000000U)
#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_LOCKED_SHIFT (28U)
/*! DCDC_OVVT_MASK_LOCKED - Lock DCDC_OVVT_MASK
 *  0b0..DCDC_OVVT_MASK's value can be changed.
 *  0b1..This bit and DCDC_OVVT_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_LOCKED_MASK (0x20000000U)
#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_LOCKED_SHIFT (29U)
/*! ECAT_RSTO_MASK_LOCKED - Lock ECAT_RSTO_MASK
 *  0b0..ECAT_RSTO_MASK's value can be changed.
 *  0b1..This bit and ECAT_RSTO_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_LOCKED_MASK)
/*! @} */

/*! @name SBMR1 - SRC Boot Mode Register 1 */
/*! @{ */

#define SRC_GENERAL_SBMR1_BOOT_CFG1_MASK         (0xFFU)
#define SRC_GENERAL_SBMR1_BOOT_CFG1_SHIFT        (0U)
/*! BOOT_CFG1 - Reserved. */
#define SRC_GENERAL_SBMR1_BOOT_CFG1(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SBMR1_BOOT_CFG1_SHIFT)) & SRC_GENERAL_SBMR1_BOOT_CFG1_MASK)

#define SRC_GENERAL_SBMR1_BOOT_CFG2_MASK         (0xFF00U)
#define SRC_GENERAL_SBMR1_BOOT_CFG2_SHIFT        (8U)
/*! BOOT_CFG2 - Reserved. */
#define SRC_GENERAL_SBMR1_BOOT_CFG2(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SBMR1_BOOT_CFG2_SHIFT)) & SRC_GENERAL_SBMR1_BOOT_CFG2_MASK)

#define SRC_GENERAL_SBMR1_BOOT_CFG3_MASK         (0xFF0000U)
#define SRC_GENERAL_SBMR1_BOOT_CFG3_SHIFT        (16U)
/*! BOOT_CFG3 - Reserved. */
#define SRC_GENERAL_SBMR1_BOOT_CFG3(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SBMR1_BOOT_CFG3_SHIFT)) & SRC_GENERAL_SBMR1_BOOT_CFG3_MASK)

#define SRC_GENERAL_SBMR1_BOOT_CFG4_MASK         (0xFF000000U)
#define SRC_GENERAL_SBMR1_BOOT_CFG4_SHIFT        (24U)
/*! BOOT_CFG4 - Reserved. */
#define SRC_GENERAL_SBMR1_BOOT_CFG4(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SBMR1_BOOT_CFG4_SHIFT)) & SRC_GENERAL_SBMR1_BOOT_CFG4_MASK)
/*! @} */

/*! @name SBMR2 - SRC Boot Mode Register 2 */
/*! @{ */

#define SRC_GENERAL_SBMR2_IPP_BOOT_MODE_MASK     (0x3F000000U)
#define SRC_GENERAL_SBMR2_IPP_BOOT_MODE_SHIFT    (24U)
/*! IPP_BOOT_MODE
 *  0b000000..Boot from internal Fuses
 *  0b000001..Serial Downloader: USB1 or LPUART1
 *  0b000010..USDHC1 8-bit eMMC 5.1
 *  0b000011..USDHC2 4-bit SD 3.0
 *  0b000100..FlexSPI Serial NOR with SFDP (JESD-216) discoverable parameters
 *  0b000101..FlexSPI Serial NAND 2k page
 *  0b000110..FlexSPI Serial NAND 4k page
 *  0b000111..Test mode/Infinite loop mode
 */
#define SRC_GENERAL_SBMR2_IPP_BOOT_MODE(x)       (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SBMR2_IPP_BOOT_MODE_SHIFT)) & SRC_GENERAL_SBMR2_IPP_BOOT_MODE_MASK)
/*! @} */

/*! @name SRSR_BBSM - SRC Reset Status Register backup in BBSM domain */
/*! @{ */

#define SRC_GENERAL_SRSR_BBSM_POR_RST_MASK       (0x1U)
#define SRC_GENERAL_SRSR_BBSM_POR_RST_SHIFT      (0U)
/*! POR_RST - Indicates whether the reset was the result of power up or chip PAD POR_B.
 *  0b0..Reset is not a result of power up or chip PAD POR_B.
 *  0b1..Reset is a result of power up or chip PAD POR_B.
 */
#define SRC_GENERAL_SRSR_BBSM_POR_RST(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_POR_RST_SHIFT)) & SRC_GENERAL_SRSR_BBSM_POR_RST_MASK)

#define SRC_GENERAL_SRSR_BBSM_WDOG1_RST_B_MASK   (0x2U)
#define SRC_GENERAL_SRSR_BBSM_WDOG1_RST_B_SHIFT  (1U)
/*! WDOG1_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog1 time-out event.
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_BBSM_WDOG1_RST_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_WDOG1_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_WDOG1_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_WDOG2_RST_B_MASK   (0x4U)
#define SRC_GENERAL_SRSR_BBSM_WDOG2_RST_B_SHIFT  (2U)
/*! WDOG2_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog2 time-out event.
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_BBSM_WDOG2_RST_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_WDOG2_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_WDOG2_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_WDOG3_RST_B_MASK   (0x8U)
#define SRC_GENERAL_SRSR_BBSM_WDOG3_RST_B_SHIFT  (3U)
/*! WDOG3_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog3 time-out
 *  0b0..Reset is not a result of the watchdog3 time-out event.
 *  0b1..Reset is a result of the watchdog3 time-out event.
 */
#define SRC_GENERAL_SRSR_BBSM_WDOG3_RST_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_WDOG3_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_WDOG3_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_WDOG4_RST_B_MASK   (0x10U)
#define SRC_GENERAL_SRSR_BBSM_WDOG4_RST_B_SHIFT  (4U)
/*! WDOG4_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog4 time-out
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_BBSM_WDOG4_RST_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_WDOG4_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_WDOG4_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_WDOG5_RST_B_MASK   (0x20U)
#define SRC_GENERAL_SRSR_BBSM_WDOG5_RST_B_SHIFT  (5U)
/*! WDOG5_RST_B - Time-out reset. Indicates whether the reset was the result of the watchdog5 time-out
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_GENERAL_SRSR_BBSM_WDOG5_RST_B(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_WDOG5_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_WDOG5_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_TEMPSENSE_RST_B_MASK (0x40U)
#define SRC_GENERAL_SRSR_BBSM_TEMPSENSE_RST_B_SHIFT (6U)
/*! TEMPSENSE_RST_B - TempSensor software reset. Indicates whether the reset was the result of software reset from on-chip Temperature Sensor.
 *  0b0..Reset is not a result of software reset from Temperature Sensor.
 *  0b1..Reset is a result of software reset from Temperature Sensor.
 */
#define SRC_GENERAL_SRSR_BBSM_TEMPSENSE_RST_B(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_TEMPSENSE_RST_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_TEMPSENSE_RST_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_EDGELOCK_RESET_B_MASK (0x80U)
#define SRC_GENERAL_SRSR_BBSM_EDGELOCK_RESET_B_SHIFT (7U)
/*! EDGELOCK_RESET_B - Indicates whether the reset was the result of the Edgelock's reset input.
 *  0b0..Reset is not a result of the Edgelock's reset event.
 *  0b1..Reset is a result of the Edgelock's reset event.
 */
#define SRC_GENERAL_SRSR_BBSM_EDGELOCK_RESET_B(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_EDGELOCK_RESET_B_SHIFT)) & SRC_GENERAL_SRSR_BBSM_EDGELOCK_RESET_B_MASK)

#define SRC_GENERAL_SRSR_BBSM_JTAG_SW_RST_MASK   (0x100U)
#define SRC_GENERAL_SRSR_BBSM_JTAG_SW_RST_SHIFT  (8U)
/*! JTAG_SW_RST - JTAG software reset. Indicates whether the reset was the result of software reset from JTAG.
 *  0b0..Reset is not a result of software reset from JTAG.
 *  0b1..Reset is a result of software reset from JTAG.
 */
#define SRC_GENERAL_SRSR_BBSM_JTAG_SW_RST(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_JTAG_SW_RST_SHIFT)) & SRC_GENERAL_SRSR_BBSM_JTAG_SW_RST_MASK)

#define SRC_GENERAL_SRSR_BBSM_CM33_REQUEST_MASK  (0x200U)
#define SRC_GENERAL_SRSR_BBSM_CM33_REQUEST_SHIFT (9U)
/*! CM33_REQUEST - Indicates whether reset was the result of cm33 reset request
 *  0b0..Reset is not a result of cm33 reset request.
 *  0b1..Reset is a result of cm33 reset request.
 */
#define SRC_GENERAL_SRSR_BBSM_CM33_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_BBSM_CM33_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_BBSM_CM33_REQUEST_MASK)

