Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_SRC_GENERAL.h
#define SRC_GENERAL_SRSR_CM33_REQUEST_MASK       (0x200U)
#define SRC_GENERAL_SRSR_CM33_REQUEST_SHIFT      (9U)
/*! CM33_REQUEST - Indicates whether reset was the result of cm33 reset request
 *  0b0..Reset is not a result of cm33 reset request.
 *  0b1..Reset is a result of cm33 reset request.
 */
#define SRC_GENERAL_SRSR_CM33_REQUEST(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM33_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_CM33_REQUEST_MASK)

#define SRC_GENERAL_SRSR_CM33_LOCKUP_MASK        (0x400U)
#define SRC_GENERAL_SRSR_CM33_LOCKUP_SHIFT       (10U)
/*! CM33_LOCKUP - Indicates a reset has been caused by cm33 CPU lockup
 *  0b0..Reset is not a result of the cm33 lockup.
 *  0b1..Reset is a result of the cm33 lockup.
 */
#define SRC_GENERAL_SRSR_CM33_LOCKUP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM33_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_CM33_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_CM7_REQUEST_MASK        (0x800U)
#define SRC_GENERAL_SRSR_CM7_REQUEST_SHIFT       (11U)
/*! CM7_REQUEST - Indicates whether reset was the result of cm7 reset request
 *  0b0..Reset is not a result of cm7 reset request.
 *  0b1..Reset is a result of cm7 reset request.
 */
#define SRC_GENERAL_SRSR_CM7_REQUEST(x)          (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM7_REQUEST_SHIFT)) & SRC_GENERAL_SRSR_CM7_REQUEST_MASK)

#define SRC_GENERAL_SRSR_CM7_LOCKUP_MASK         (0x1000U)
#define SRC_GENERAL_SRSR_CM7_LOCKUP_SHIFT        (12U)
/*! CM7_LOCKUP - Indicates a reset has been caused by CM7 CPU
 *  0b0..Reset is not a result of the cm7 lockup.
 *  0b1..Reset is a result of the cm7 lockup.
 */
#define SRC_GENERAL_SRSR_CM7_LOCKUP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_CM7_LOCKUP_SHIFT)) & SRC_GENERAL_SRSR_CM7_LOCKUP_MASK)

#define SRC_GENERAL_SRSR_DCDC_OVVT_MASK          (0x2000U)
#define SRC_GENERAL_SRSR_DCDC_OVVT_SHIFT         (13U)
/*! DCDC_OVVT - Indicates a reset has been caused by DCDC over voltage
 *  0b0..Reset is not a result of the DCDC over voltage.
 *  0b1..Reset is a result of the DCDC over voltage.
 */
#define SRC_GENERAL_SRSR_DCDC_OVVT(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_DCDC_OVVT_SHIFT)) & SRC_GENERAL_SRSR_DCDC_OVVT_MASK)

#define SRC_GENERAL_SRSR_ECAT_RSTO_MASK          (0x4000U)
#define SRC_GENERAL_SRSR_ECAT_RSTO_SHIFT         (14U)
/*! ECAT_RSTO - Indicates a reset has been caused by ECAT reset output
 *  0b0..Reset is not a result of the ECAT reset output.
 *  0b1..Reset is a result of the ECAT reset output.
 */
#define SRC_GENERAL_SRSR_ECAT_RSTO(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_ECAT_RSTO_SHIFT)) & SRC_GENERAL_SRSR_ECAT_RSTO_MASK)

#define SRC_GENERAL_SRSR_IPP_POR_B_MASK          (0x10000U)
#define SRC_GENERAL_SRSR_IPP_POR_B_SHIFT         (16U)
/*! IPP_POR_B - Indicates whether the reset was the result of chip PAD POR_B.
 *  0b0..Reset is not a result of chip PAD POR_B.
 *  0b1..Reset is a result of chip PAD POR_B.
 */
#define SRC_GENERAL_SRSR_IPP_POR_B(x)            (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRSR_IPP_POR_B_SHIFT)) & SRC_GENERAL_SRSR_IPP_POR_B_MASK)
/*! @} */

/*! @name GPR - SRC General Purpose Register */
/*! @{ */

#define SRC_GENERAL_GPR_GPR_MASK                 (0xFFFFFFFFU)
#define SRC_GENERAL_GPR_GPR_SHIFT                (0U)
/*! GPR - General Purpose Register. */
#define SRC_GENERAL_GPR_GPR(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_GPR_GPR_SHIFT)) & SRC_GENERAL_GPR_GPR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SRC_GENERAL_Register_Masks */


/*!
 * @}
 */ /* end of group SRC_GENERAL_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SRC_GENERAL_H_ */

